---
type: MEPAnalyticalSystem
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 5
tags: [revit-api, class]
---

# MEPAnalyticalSystem

`Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2020.1 | `public static MEPAnalyticalSystem Create ( Document document , AnalyticalSystemDomain domain , string name )` |
| Method | GetAirSystemData | 2020.1 | `public AirSystemData GetAirSystemData ()` |
| Method | GetWaterLoopData | 2020.1 | `public WaterLoopData GetWaterLoopData ()` |
| Property | AnalyticalSystemDomain | 2020.1 | `public AnalyticalSystemDomain AnalyticalSystemDomain { get ; }` |
| Property | Parameter | — | `` |